import FadeHeading from "@/components/website/atom/heading/FadeHeading";
import MainHeading from "@/components/website/atom/heading/MainHeading";
import Cover from "@/components/website/layout/Cover";
import CoverVisa from "@/components/website/layout/CoverVisa";
import { Link } from "@/i18n/routing";
import { useTranslations } from "next-intl";
import Image from "next/image";
import { FaArrowCircleDown, FaEye } from "react-icons/fa";

const title = {
  jp: "その他",
  en: "Others",
  th: "อื่นๆ",
};

const ContentJP = () => {
  return (
    <div className="grid grid-cols-1 gap-6 text-[#333333] font-medium">
      <div className="">
        <MainHeading text="90日レポート・その他" heading="1" />
        <div id="t-12" className="py-4 md:py-10 border-b-2 border-slate-200 ">
          <FadeHeading text="90日レポート" heading="2" />
          <p className="py-6 text-sm">
            ブルーアシスタンス株式会社ではタイ（バンコク）にて90日レポートの代行を行っております。再入国やリエントリーパーミットについても初めての方でも安心して手続きができるように、申請のサポートや代行をしております。
          </p>
          <h3 className="py-4 font-bold text-lg text-blue-900">90日レポート</h3>
          <div className="detail-sty text-sm">
            <p>
              主にノンイミグラントビザ（B、O、EDなど）を取得している外国人が、タイ国を90日以上出国しない場合、入国管理局へその移住地を報告する義務がございます。90日レポートを怠ると罰金の対象となります。申告は、滞在初年度、初回は滞在延長申請をした日から起算して90日目が期日となります。2回目以降は、前回の90日レポートをした日から90日目、もしくは最後にタイへ入国した日から数えて90日目が期日となります。
              <br /> ※申告は90日の期日より15日前から、期日の7日後まで可能です。
            </p>

            <br />

            <p>
              90日レポート申告方法
              <br />
              ① 入国管理局における申告
              <br />
              ② 郵送
              <br />③ オンライン申請
            </p>

            <br />

            <p>
              申告は各90日目前の15日間、後7日間の間に、ご本人または代理人が直接入国管理局（滞在延長を行った入国管理局での申告が必要）またはワンストップサービスで行います。
            </p>
            <p className="">
              ※②郵送は郵便事情などの理由よりおすすめしておりません。
            </p>
            <p className="pl-[14px]">
              ③オンライン申請は期日の7日前までのみ。申請後受理まで日数がかかる場合があります。
            </p>

            <br />

            <p>
              必要書類 <br />
              パスポート原本、申請用紙（TM47）、外国人滞在報告書（TM30）
            </p>
            <p className="mt-4">
              弊社にて90日レポート申請代行を行っております。お気軽にお問合せ下さいませ。
            </p>
          </div>
        </div>
        <div id="t-13" className="py-4 md:py-10 border-b-2 border-slate-200">
          <FadeHeading
            text="90日レポートの期間が過ぎてしまった場合"
            heading="2"
          />
          <div className="py-5 text-sm">
            <p className="">
              90日の期限を過ぎて7日間は報告の猶予がございます。その日にちを過ぎると、罰金が課せられます。
            </p>

            <p className="">
              期限が過ぎて申請をする場合は、基本的にご本人様の出頭が必要です。
            </p>
            <p className="py-2">
              ※申請場所やタイミングによって条件が異なる場合がございます。詳しくはお問い合わせください。
            </p>
          </div>
        </div>
        <div id="t-14" className="py-4 md:py-10 border-b-2 border-slate-200">
          <FadeHeading text="オーバーステイについて" heading="2" />
          <h3 className="py-4 font-bold text-lg text-blue-900">
            オーバーステイ(不法滞在)
          </h3>
          <div className="text-sm">
            <div className="detail-sty">
              <p>
                ご自身が取得されてもタイに滞在している場合、不法滞在となります。リエントリーパーミットにも有効期限（ビザの有効期限と連動）があります。この日を過ぎると使えません、不法滞在になります。タイ入国時は必ずパスポートに押された滞在期限のスタンプ日付をご確認下さい。
              </p>

              <br />

              <p>
                オーバーステイ（不法滞在）をした外国人には、タイ政府が罰金及び国外退去、再入国不可等の罰則が与えられます。
                <br />
                以下2016年3月20日、政令となります。（在京タイ大使館Web情報より）
                <br />
                <a
                  className="text-blue-700"
                  target="_blank"
                  href="https://site.thaiembassy.jp/jp/news/consular/4575/?sphrase_id=4517320"
                >
                  https://site.thaiembassy.jp/jp/news/consular/4575/?sphrase_id=4517320
                </a>
              </p>

              <br />

              <strong className="text-base">1. 出頭した外国人の場合</strong>
              <ul className="">
                <li>
                  1.1
                  滞在許可最終日より数えて90日を超えて滞在した外国人は、王国出国後１年間は入国不可
                </li>
                <li>
                  1.2
                  滞在許可最終日より数えて1年を超えて滞在した外国人は、王国出国後3年間は入国不可
                </li>
                <li>
                  1.3
                  滞在許可最終日より数えて3年を超えて滞在した外国人は、王国出国後5年間は入国不可
                </li>
                <li>
                  1.4
                  滞在許可最終日より数えて5年を超えて滞在した外国人は、王国出国後10年間は入国不可
                </li>
              </ul>

              <br />

              <strong className="text-base">2. 逮捕された外国人の場合</strong>
              <ul className="list-number-point2">
                <li>
                  2.1
                  滞在許可最終日より数えて1年を超えない滞在をした外国人は、王国出国後5年間は入国不可
                </li>
                <li>
                  2.2
                  滞在許可最終日より数えて1年を超えて滞在した外国人は、王国出国後10年間は入国不可
                </li>
              </ul>

              <br />

              <strong className="text-base">
                3. この法令は以下の場合には適用されない
              </strong>
              <ul className="">
                <li>(1) 年齢が18歳になる前に王国を出国する外国人</li>
                <li>(2) この政令が適用される前に王国を出国する外国人。</li>
              </ul>

              <br />

              <p>
                ⚠オーバーステイにご注意ください
                <br />
                ・ビザ取得更新時、タイ入国時など、ご自身の滞在期間を必ずご確認ください。
                <br />
                ・ビザを取得したあとにタイ国外へ出国する際には、必ず
                <Link
                  href="/visa-workpermit/visa#t-11"
                  className="text-blue-800 underline"
                >
                  再入国許可証（リエントリーパーミット
                </Link>
                ）を取得してからご出発するようにしてください。
                <br />
                ・タイ入国の際は、パスポートに押されるスタンプに記載されている滞在期間を確認してください。
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
const ContentEN = () => {
  return <ContentJP />;
};

const ContentTH = () => {
 return (
    <div className="grid grid-cols-1 gap-6 text-[#333333] font-medium">
      <div className="">
        <MainHeading text="การรายงานตัว 90 วัน และ อื่นๆ" heading="1" />
        <div id="t-12" className="py-4 md:py-10 border-b-2 border-slate-200 ">
          <FadeHeading text="การรายงานตัว 90 วัน" heading="2" />
          <p className="py-6 text-sm">
            บริษัท บลู แอสซิสแท็นซ จำกัด ให้บริการรายงานตัวแทนทุก 90 วันในประเทศไทย (กรุงเทพฯ)
            นอกจากนี้เรายังให้ความช่วยเหลือและเป็นตัวแทนในการยื่นขอใบอนุญาตกลับเข้าประเทศ
            เพื่อให้ท่านดำเนินการยื่นคำร้องได้ด้วยความอุ่นใจแม้แต่ผู้ที่เพิ่งใช้บริการเป็นครั้งแรก
          </p>
          <h3 className="py-4 font-bold text-lg text-blue-900">การรายงานตัว 90 วัน</h3>
          <div className="detail-sty text-sm">
            <p>
              ในกรณีคนต่างด้าวที่ถือวีซ่าประเภทคนอยู่ชั่วคราวหรือ Non-Immigrant Visa (รหัส B, O
              และ ED) มิได้เดินทางออกประเทศไทยเป็นระยะเวลาเกิน 90 วัน บุคคลดังกล่าวจะต้องรายงานที่พักอาศัยต่อสำนักงานตรวจคนเข้าเมือง 
              หากไม่รายงานตัวทุก 90 วันจะถูกดำเนินการเปรียบเทียบปรับ
              สำหรับปีแรกของการพำนัก การรายงานตัวครั้งแรกคือ 90 วันหลังจากวันที่ยื่นคำร้องขอขยายระยะเวลาการพำนัก 
              สำหรับการรายงานตัวตั้งแต่ครั้งที่สองเป็นต้นไป ต้องรายงานโดยคำนวณจากวันที่เดินทางเข้าประเทศไทยหรือการรายงานตัว 
              90 วันครั้งก่อนหน้า
            </p>

            <br />

            <p>
              วิธีรายงานตัว 90 วัน
              <br />
              ① รายงานตัวที่สำนักตรวจคนเข้าเมือง
              <br />
              ② ทางไปรษณีย์
              <br />
              ③ การรายงานผ่านระบบออนไลน์
            </p>

            <br />

            <p>
              คนต่างด้าวหรือตัวแทนสามารถแจ้งที่พักอาศัยได้โดยตรงที่สำนักตรวจคนเข้าเมือง ก่อน 15 วันหรือหลังไม่เกิน 7 วัน 
              นับจากวันครบกำหนด 90 วัน (ต้องแจ้งต่อสำนักตรวจคนเข้าเมืองที่ยื่นเรื่องขยายระยะเวลาพำนัก) 
              หรือศูนย์บริการวีซ่าและใบอนุญาตทำงานแบบ One Stop Service
            </p>
            <p className="">
              ※② เราไม่แนะนำให้ส่งทางไปรษณีย์เนื่องจากอาจจะเกิดปัญหาในการจัดส่ง
            </p>
            <p className="pl-[14px]">
              ③ สามารถส่งใบสมัครออนไลน์ได้ ก่อน 15 วันก่อนครบกำหนดรายงานตัว 90 วัน เนื่องจากการตรวจสอบอาจใช้เวลาหลายวันจึงจะได้รับการอนุมัติ
            </p>

            <br />

            <p>
              เอกสารที่ต้องใช้ <br />
              หนังสือเดินทางตัวจริง, แบบฟอร์มคำร้อง (TM47), รายงานการเข้าพักของชาวต่างชาติ (TM30) กรณี แจ้งรายงานตัว 90 วัน ที่ สำนักงานตรวจคนเข้าเมือง
            </p>
            <p className="mt-4">
              บริษัทเราให้บริการรายงานตัวแทนทุก 90 วัน โปรดติดต่อเราเพื่อสอบถามรายละเอียดเพิ่มเติม
            </p>
          </div>
        </div>
        <div id="t-13" className="py-4 md:py-10 border-b-2 border-slate-200">
          <FadeHeading
            text="ในกรณีที่เลยระยะเวลาการรายงาน 90 วันไปแล้ว"
            heading="2"
          />
          <div className="py-5 text-sm">
            <p className="">
              คุณสามารถยื่น รายงานตัว 90 วัน ได้ก่อน วันครบกำหนด 15 วัน และ ไม่เกิน 7 วันหลังครบกำหนด
            </p>

            <p className="">
              หากเกินกำหนด การรายงานตัว 90 วัน คุณต้องเสียค่าปรับ 2000 บาท ด้วยตัวเอง ที่ สำนักงานตรวจคนเข้าเมือง
            </p>
            <p className="py-2">
              ※เงื่อนไขอาจแตกต่างกันไป ขึ้นอยู่กับสถานที่และระยะเวลาการสมัคร กรุณาติดต่อเราเพื่อดูรายละเอียด
            </p>
          </div>
        </div>
        <div id="t-14" className="py-4 md:py-10 border-b-2 border-slate-200">
          <FadeHeading text="การอยู่เกินกำหนดระยะอนุญาต" heading="2" />
          <h3 className="py-4 font-bold text-lg text-blue-900">
            การอยู่เกินกำหนดระยะอนุญาต (การอยู่ในประเทศอย่างผิดกฎหมาย)
          </h3>
          <div className="text-sm">
            <div className="detail-sty">
              <p>
                วีซ่าของท่านมีกำหนดระยะเวลาในการพำนัก หากท่านพำนักอยู่ในประเทศไทยเกินกำหนดระยะเวลาในการพำนัก 
                จะถือว่าท่านอยู่ในประเทศอย่างผิดกฎหมาย การขออนุญาตกลับเข้ามาในประเทศก็มีกำหนดระยะเวลาเช่นกัน 
                (สอดคล้องกำหนดระยะเวลาของวีซ่า) หากเกินจากวันดังกล่าวจะไม่สามารถใช้ได้และถือเป็นการอยู่ในประเทศอย่างผิดกฎหมาย
                ทุกครั้งที่เดินทางเข้าประเทศไทยโปรดตรวจสอบวันที่ประทับตรากำหนดระยะเวลาในการพำนักบนหนังสือเดินทางของท่าน
              </p>

              <br />

              <p>
                คนต่างด้าวที่อยู่เกินกำหนดระยะอนุญาต (อยู่ในประเทศอย่างผิดกฎหมาย) จะมีโทษทางกฎหมายของไทย 
                โดยการเสียค่าปรับและถูกเนรเทศออกนอกประเทศ ตลอดจนห้ามมิให้เดินทางกลับเข้ามาในประเทศ 
                คำสั่งรัฐมนตรีว่าการกระทรวงมหาดไทยมีผลบังคับใช้ตั้งแต่วันที่ 20 มีนาคม 2016
                (ข้อมูลจากเว็บไซต์ สถานเอกอัครราชทูตญี่ปุ่นประจำประเทศไทย)
                <br />
                <a
                  className="text-blue-700"
                  target="_blank"
                  href="https://site.thaiembassy.jp/jp/news/consular/4575/?sphrase_id=4517320"
                >
                  https://site.thaiembassy.jp/jp/news/consular/4575/?sphrase_id=4517320
                </a>
              </p>

              <br />

              <strong className="text-base">1. กรณีคนต่างด้าวเข้ามอบตัว</strong>
              <ul className="">
                <li>
                  1.1
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตมากกว่า 90 วัน จะถูกห้ามกลับเข้ามาเป็นเวลา 1 ปีนับตั้งแต่วันที่เดินทางออกจากราชอาณาจักร
                </li>
                <li>
                  1.2
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตมากกว่า 1 ปี จะถูกห้ามกลับเข้ามาเป็นเวลา 3 ปีนับตั้งแต่วันที่เดินทางออกจากราชอาณาจักร
                </li>
                <li>
                  1.3
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตมากกว่า 3 ปี จะถูกห้ามกลับเข้ามาเป็นเวลา 5 ปีนับตั้งแต่วันที่เดินทางออกจากราชอาณาจักร
                </li>
                <li>
                  1.4
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตมากกว่า 5 ปี จะถูกห้ามกลับเข้ามาเป็นเวลา10 ปีนับตั้งแต่วันที่เดินทางออกจากราชอาณาจักร
                </li>
              </ul>

              <br />

              <strong className="text-base">2. กรณีคนต่างด้าวถูกจับกุมดำ เนินคดี</strong>
              <ul className="list-number-point2">
                <li>
                  2.1
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตต่ำ กว่า 1 ปี จะถูกห้ามกลับเข้ามาเป็นเวลา 5 ปีนับตั้งแต่วันที่เดินทางออกจากราชอาณาจักร
                </li>
                <li>
                  2.2
                  หากอยู่เกินระยะเวลาที่ได้รับอนุญาตมากกว่า 1 ปี จะถูกห้ามกลับเข้ามาเป็นเวลา 10 ปีนับตั้งแต่ วันที่เดินทางออกจากราชอาณาจักร
                </li>
              </ul>

              <br />

              <strong className="text-base">
                3. กฎหมายฉบับนี้ใช้ไม่ได้ในกรณีต่อไปนี้
              </strong>
              <ul className="">
                <li>(1) คนต่างด้าวที่เดินทางออกนอกราชอาณาจักรก่อนอายุครบ 18 ปี</li>
                <li>(2) คนต่างด้าวที่เดินทางออกนอกราชอาณาจักรก่อนบังคับใช้กฎหมายฉบับนี้</li>
              </ul>

              <br />

              <p>
                หากท่านมิได้อยู่เกินกำหนดระยะอนุญาต โปรดตรวจสอบวีซ่าและระยะเวลาในการพำนักของท่าน
                เมื่อท่านได้รับวีซ่าและมีความประสงค์ที่จะเดินทางออกนอกประเทศ 
                ต้องแน่ใจว่าท่านได้รับอนุญาตให้เดินทางกลับเข้าประเทศก่อนเดินทางออกนอกประเทศเสมอ เมื่อเดินทางเข้าประเทศ 
                สิ่งสำคัญคือต้องตรวจสอบตราประทับระยะเวลาในการพำนักและพยายามไม่อยู่เกินกำหนดระยะอนุญาต
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default function Work({ params }: { params: { lng: string } }) {
  const t = useTranslations("header");
  const s = useTranslations("service-section");
  const lang = params.lng;
  const content =
    lang == "jp" ? <ContentJP /> : lang == "en" ? <ContentEN /> : <ContentTH />;

  return (
    <>
      <div className="">
        <CoverVisa
          // @ts-ignore
          pageName={title[lang]}
          prevPage={{ pageName: t("visa-work"), url: "/visa-workpermit" }}
        />
        <div className="container mx-auto  ">{content}</div>
      </div>
    </>
  );
}
